Repository: MohamedEmad7299/To-Do
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Tasks
ar: المهام

source: Calendar
ar: التقويم

source: Focus
ar: التركيز

source: Profile
ar: الملف الشخصي

# welcome
source: Welcome to TO-DO
ar: مرحباً بك في TO-DO

# welcomeMessage
source: Please login to your account or create new account to continue
ar: يرجى تسجيل الدخول إلى حسابك أو إنشاء حساب جديد للمتابعة

source: LOGIN
ar: تسجيل الدخول

source: CREATE ACCOUNT
ar: إنشاء حساب

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

# enterUsername
source: Enter your username
ar: أدخل اسم المستخدم

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

# repeatPassword
source: Repeat your password
ar: أعد إدخال كلمة المرور

source: Forget Password ?
ar: هل نسيت كلمة المرور؟

# loginButton
source: Login
ar: تسجيل الدخول

# registerButton
source: Register
ar: تسجيل

source: Login with Google
ar: تسجيل الدخول باستخدام Google

source: Login with Facebook
ar: تسجيل الدخول باستخدام Facebook

source: Register with Google
ar: التسجيل باستخدام Google

source: Register with Facebook
ar: التسجيل باستخدام Facebook

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Register
ar: تسجيل

# pleaseConfirmPassword
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Authentication failed
ar: فشلت المصادقة

# pleaseSignInFirst
source: Please sign in first to enable fingerprint login
ar: يرجى تسجيل الدخول أولاً لتفعيل تسجيل الدخول ببصمة الإصبع

# authenticateToEnable
source: Authenticate to enable fingerprint login
ar: المصادقة لتفعيل تسجيل الدخول ببصمة الإصبع

source: SKIP
ar: تخطي

source: BACK
ar: رجوع

source: NEXT
ar: التالي

source: GET STARTED
ar: ابدأ الآن

# onboarding1Title
source: Manage your tasks
ar: إدارة مهامك

# onboarding1Description
source: You can easily manage all of your daily tasks in TO-DO for free
ar: يمكنك إدارة جميع مهامك اليومية بسهولة في TO-DO مجاناً

# onboarding2Title
source: Create daily routine
ar: إنشاء روتين يومي

# onboarding2Description
source: In TO-DO you can create your personalized routine to stay productive
ar: في TO-DO يمكنك إنشاء روتينك الشخصي للبقاء منتجاً

# onboarding3Title
source: Organize your tasks
ar: تنظيم مهامك

# onboarding3Description
source: You can organize your daily tasks by adding your tasks into separate categories
ar: يمكنك تنظيم مهامك اليومية عن طريق إضافة مهامك إلى فئات منفصلة

source: Sort by
ar: الترتيب حسب

source: Date
ar: التاريخ

source: Name
ar: الاسم

source: Priority
ar: الأولوية

source: Sorted by:
ar: مرتب حسب:

source: Name (A-Z)
ar: الاسم (أ-ي)

source: Priority (1-12)
ar: الأولوية (1-12)

source: Pending
ar: قيد الانتظار

source: Completed
ar: مكتملة

# whatToDoToday
source: What do you want to do today?
ar: ما الذي تريد القيام به اليوم؟

# tapToAddTasks
source: Tap + to add your tasks
ar: اضغط + لإضافة مهامك

# tasksLeft
source: Task left
ar: مهمة متبقية

# tasksLeftPlural
source: Tasks left
ar: مهام متبقية

# tasksDone
source: Task done
ar: مهمة مكتملة

# tasksDonePlural
source: Tasks done
ar: مهام مكتملة

source: Add Task
ar: إضافة مهمة

# taskNameHint
source: Do math homework
ar: أداء الواجبات المنزلية في الرياضيات

source: Description
ar: الوصف

# pleaseEnterTaskName
source: Please enter a task name
ar: يرجى إدخال اسم المهمة

# pleaseSelectCategory
source: Please select a category
ar: يرجى اختيار فئة

# pleaseSelectPriority
source: Please select a priority
ar: يرجى اختيار الأولوية

# pleaseSelectDateTime
source: Please select date and time
ar: يرجى اختيار التاريخ والوقت

source: Task added successfully!
ar: تمت إضافة المهمة بنجاح!

# priorityLabel
source: Priority
ar: الأولوية

source: Task Priority
ar: أولوية المهمة

source: Choose Time
ar: اختر الوقت

source: Save
ar: حفظ

source: SUN
ar: الأحد

source: MON
ar: الاثنين

source: TUE
ar: الثلاثاء

source: WED
ar: الأربعاء

source: THU
ar: الخميس

source: FRI
ar: الجمعة

source: SAT
ar: السبت

source: Choose Category
ar: اختر الفئة

# longPressToDelete
source: Long press on custom categories to delete
ar: اضغط لفترة طويلة على الفئات المخصصة للحذف

source: Create New
ar: إنشاء جديد

source: Add Category
ar: إضافة فئة

source: Delete Category
ar: حذف الفئة

# deleteCategoryConfirmPrefix
source: Are you sure you want to delete "
ar: هل أنت متأكد أنك تريد حذف "

source: Delete
ar: حذف

# categoryDeletedSuccessSuffix
source: deleted successfully!
ar: بنجاح!

# categoryDeleteFailedPrefix
source: Failed to delete category:
ar: فشل حذف الفئة:

# categoryCreatedSuccess
source: Category created successfully!
ar: تم إنشاء الفئة بنجاح!

# categoryCreateFailedPrefix
source: Failed to create category:
ar: فشل إنشاء الفئة:

# usingDefaultCategoriesPrefix
source: Using default categories:
ar: استخدام الفئات الافتراضية:

source: Create New Category
ar: إنشاء فئة جديدة

source: Category name
ar: اسم الفئة

source: Choose Color
ar: اختر اللون

source: Choose Icon
ar: اختر الأيقونة

source: Create
ar: إنشاء

# pleaseEnterCategoryName
source: Please enter a category name
ar: يرجى إدخال اسم الفئة

# pleaseSelectColor
source: Please select a color
ar: يرجى اختيار لون

# pleaseSelectIcon
source: Please select an icon
ar: يرجى اختيار أيقونة

# categoryGrocery
source: Grocery
ar: البقالة

# categoryWork
source: Work
ar: العمل

# categorySport
source: Sport
ar: الرياضة

# categoryDesign
source: Design
ar: التصميم

# categoryUniversity
source: University
ar: الجامعة

# categorySocial
source: Social
ar: الاجتماعية

# categoryMusic
source: Music
ar: الموسيقى

# categoryHealth
source: Health
ar: الصحة

# categoryMovie
source: Movie
ar: الأفلام

# categoryHome
source: Home
ar: المنزل

source: Settings
ar: الإعدادات

source: Account
ar: الحساب

source: App Settings
ar: إعدادات التطبيق

source: Theme Color
ar: لون المظهر

source: Change account name
ar: تغيير اسم الحساب

source: Change account password
ar: تغيير كلمة مرور الحساب

source: Change account Image
ar: تغيير صورة الحساب

source: About US
ar: من نحن

source: FAQ
ar: الأسئلة الشائعة

source: Help & Feedback
ar: المساعدة والملاحظات

source: Support US
ar: ادعمنا

source: Log out
ar: تسجيل الخروج

# logoutConfirmTitle
source: Logout
ar: تسجيل الخروج

# logoutConfirmMessage
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

# logoutFailed
source: Logout failed: {error}
ar: فشل تسجيل الخروج: {error}

source: Security
ar: الأمان

source: General
ar: عام

source: About
ar: حول

source: Fingerprint Login
ar: تسجيل الدخول ببصمة الإصبع

# fingerprintDescription
source: Use fingerprint to quickly access your account
ar: استخدم بصمة الإصبع للوصول السريع إلى حسابك

# enableFingerprint
source: Enable fingerprint authentication
ar: تفعيل المصادقة ببصمة الإصبع

# notAvailableOnDevice
source: Not available on this device
ar: غير متوفر على هذا الجهاز

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Clear Cache
ar: مسح ذاكرة التخزين المؤقت

# freeUpStorage
source: Free up storage space
ar: توفير مساحة التخزين

source: App Version
ar: إصدار التطبيق

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Service
ar: شروط الخدمة

source: Clear All Tasks
ar: حذف جميع المهام

# clearAllTasksMessage
source: Are you sure you want to clear all tasks? This action cannot be undone and will permanently delete all your tasks.
ar: هل أنت متأكد أنك تريد حذف جميع المهام؟ لا يمكن التراجع عن هذا الإجراء وسيتم حذف جميع مهامك نهائياً.

source: Clear All
ar: حذف الكل

# allTasksCleared
source: All tasks cleared successfully!
ar: تم حذف جميع المهام بنجاح!

# fingerprintEnabled
source: Fingerprint login enabled
ar: تم تفعيل تسجيل الدخول ببصمة الإصبع

# fingerprintDisabled
source: Fingerprint login disabled
ar: تم تعطيل تسجيل الدخول ببصمة الإصبع

# passwordRequired
source: Password is required to enable fingerprint login
ar: كلمة المرور مطلوبة لتفعيل تسجيل الدخول ببصمة الإصبع

# incorrectPassword
source: Incorrect password. Please try again.
ar: كلمة مرور خاطئة. يرجى المحاولة مرة أخرى.

# biometricAuthReason
source: Please authenticate to access your account
ar: يرجى المصادقة للوصول إلى حسابك

# biometricAuthTitle
source: Biometric authentication required
ar: المصادقة البيومترية مطلوبة

source: Authentication cancelled
ar: تم إلغاء المصادقة

# biometricNotAvailable
source: Biometric authentication not available
ar: المصادقة البيومترية غير متاحة

# biometricCheckFailed
source: Failed to check biometric availability
ar: فشل التحقق من توفر المصادقة البيومترية

# noUserSignedInBefore
source: No user has signed in before. Please sign in manually first.
ar: لم يسجل أي مستخدم الدخول من قبل. يرجى تسجيل الدخول يدوياً أولاً.

source: Failed to sign in
ar: فشل تسجيل الدخول

# weakPassword
source: The password is too weak.
ar: كلمة المرور ضعيفة جداً.

# emailAlreadyInUse
source: An account already exists for that email.
ar: يوجد حساب بالفعل لهذا البريد الإلكتروني.

# invalidEmail
source: The email address is not valid.
ar: عنوان البريد الإلكتروني غير صالح.

# registrationError
source: An error occurred during registration
ar: حدث خطأ أثناء التسجيل

# unexpectedError
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

# userNotFound
source: No user found for that email.
ar: لم يتم العثور على مستخدم لهذا البريد الإلكتروني.

# wrongPassword
source: Wrong password provided.
ar: كلمة المرور المقدمة خاطئة.

# loginError
source: An error occurred during login
ar: حدث خطأ أثناء تسجيل الدخول

# googleSignInCancelled
source: Google sign-in was cancelled.
ar: تم إلغاء تسجيل الدخول بواسطة Google.

# googleSignInError
source: Error during Google sign-in.
ar: خطأ أثناء تسجيل الدخول بواسطة Google.

# googleSignInUnexpectedError
source: An unexpected error occurred during Google sign-in
ar: حدث خطأ غير متوقع أثناء تسجيل الدخول بواسطة Google

# facebookSignInCancelled
source: Facebook sign-in was cancelled.
ar: تم إلغاء تسجيل الدخول بواسطة Facebook.

source: Facebook sign-in failed
ar: فشل تسجيل الدخول بواسطة Facebook

# facebookSignInError
source: Error during Facebook sign-in.
ar: خطأ أثناء تسجيل الدخول بواسطة Facebook.

# facebookSignInUnexpectedError
source: An unexpected error occurred during Facebook sign-in
ar: حدث خطأ غير متوقع أثناء تسجيل الدخول بواسطة Facebook

# tooManyAttempts
source: Too many attempts. Please try again later.
ar: محاولات كثيرة جداً. يرجى المحاولة مرة أخرى لاحقاً.

# passwordResetFailed
source: Failed to send password reset email
ar: فشل إرسال بريد إعادة تعيين كلمة المرور

# passwordResetUnexpectedError
source: An unexpected error occurred while sending reset email
ar: حدث خطأ غير متوقع أثناء إرسال بريد إعادة التعيين

source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetPasswordDescription
source: Enter your email address and we'll send you a link to reset your password.
ar: أدخل عنوان بريدك الإلكتروني وسنرسل لك رابطاً لإعادة تعيين كلمة المرور.

source: Send Reset Link
ar: إرسال رابط إعادة التعيين

# passwordResetLinkSent
source: Password reset link sent! Check your email.
ar: تم إرسال رابط إعادة تعيين كلمة المرور! تحقق من بريدك الإلكتروني.

source: Enter Your Password
ar: أدخل كلمة المرور الخاصة بك

# passwordDialogMessage
source: To enable fingerprint login, please enter your password. It will be stored securely on your device.
ar: لتفعيل تسجيل الدخول ببصمة الإصبع، يرجى إدخال كلمة المرور. سيتم تخزينها بشكل آمن على جهازك.

source: Confirm
ar: تأكيد

# lastUpdated
source: Last updated: {year}
ar: آخر تحديث: {year}

# ppIntroduction
source: Introduction
ar: مقدمة

# ppIntroductionText
source: Welcome to TO-DO App. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our mobile application. Please read this privacy policy carefully.
ar: مرحباً بك في تطبيق TO-DO. توضح سياسة الخصوصية هذه كيفية جمع معلوماتك واستخدامها والكشف عنها وحمايتها عند استخدام تطبيقنا للهاتف المحمول. يرجى قراءة سياسة الخصوصية هذه بعناية.

# ppInformationWeCollect
source: Information We Collect
ar: المعلومات التي نجمعها

# ppInformationWeCollectText
source: We collect information that you provide directly to us when you: • Create an account • Use our task management features • Contact us for support • Enable biometric authentication This may include your email address, name, and task data.
ar: نقوم بجمع المعلومات التي تقدمها لنا مباشرة عندما: • تنشئ حساباً • تستخدم ميزات إدارة المهام • تتصل بنا للحصول على الدعم • تفعل المصادقة البيومترية قد يشمل ذلك عنوان بريدك الإلكتروني واسمك وبيانات المهام.

# ppHowWeUse
source: How We Use Your Information
ar: كيف نستخدم معلوماتك

# ppHowWeUseText
source: We use the information we collect to: • Provide, maintain, and improve our services • Process and complete transactions • Send you technical notices and support messages • Respond to your comments and questions • Protect against fraudulent or illegal activity
ar: نستخدم المعلومات التي نجمعها من أجل: • توفير خدماتنا وصيانتها وتحسينها • معالجة المعاملات وإتمامها • إرسال إشعارات ورسائل دعم فنية • الرد على تعليقاتك وأسئلتك • الحماية من الأنشطة الاحتيالية أو غير القانونية

# ppDataStorage
source: Data Storage and Security
ar: تخزين البيانات والأمان

# ppDataStorageText
source: Your data is securely stored using Firebase services. We implement appropriate technical and organizational measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction. Biometric data (fingerprint) is stored locally on your device and never transmitted to our servers.
ar: يتم تخزين بياناتك بشكل آمن باستخدام خدمات Firebase. نطبق تدابير تقنية وتنظيمية مناسبة لحماية معلوماتك الشخصية من الوصول غير المصرح به أو التغيير أو الكشف أو التدمير. يتم تخزين البيانات البيومترية (بصمة الإصبع) محلياً على جهازك ولا يتم إرسالها إلى خوادمنا مطلقاً.

# ppDataSharing
source: Data Sharing
ar: مشاركة البيانات

# ppDataSharingText
source: We do not sell, trade, or rent your personal information to third parties. We may share your information only in the following circumstances: • With your consent • To comply with legal obligations • To protect our rights and safety
ar: لا نبيع أو نتاجر أو نؤجر معلوماتك الشخصية لأطراف ثالثة. قد نشارك معلوماتك فقط في الظروف التالية: • بموافقتك • للامتثال للالتزامات القانونية • لحماية حقوقنا وسلامتنا

# ppYourRights
source: Your Rights
ar: حقوقك

# ppYourRightsText
source: You have the right to: • Access your personal data • Correct inaccurate data • Delete your account and data • Opt-out of certain data collection • Export your data
ar: لديك الحق في: • الوصول إلى بياناتك الشخصية • تصحيح البيانات غير الدقيقة • حذف حسابك وبياناتك • إلغاء الاشتراك في جمع بيانات معينة • تصدير بياناتك

# ppChildrensPrivacy
source: Children's Privacy
ar: خصوصية الأطفال

# ppChildrensPrivacyText
source: Our service is not intended for users under the age of 13. We do not knowingly collect personal information from children under 13. If you are a parent or guardian and believe your child has provided us with personal information, please contact us.
ar: خدمتنا غير مخصصة للمستخدمين الذين تقل أعمارهم عن 13 عاماً. لا نقوم عن قصد بجمع معلومات شخصية من الأطفال دون سن 13 عاماً. إذا كنت والداً أو وصياً وتعتقد أن طفلك قد قدم لنا معلومات شخصية، يرجى الاتصال بنا.

# ppChanges
source: Changes to This Policy
ar: التغييرات على هذه السياسة

# ppChangesText
source: We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the "Last updated" date.
ar: قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سنقوم بإخطارك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة وتحديث تاريخ "آخر تحديث".

# ppContact
source: Contact Us
ar: اتصل بنا

# ppContactText
source: If you have any questions about this Privacy Policy, please contact us at: Email: support@todoapp.com Website: www.todoapp.com
ar: إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا على: البريد الإلكتروني: support@todoapp.com الموقع الإلكتروني: www.todoapp.com

# tosAgreement
source: Agreement to Terms
ar: الموافقة على الشروط

# tosAgreementText
source: By accessing and using TO-DO App, you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to these Terms of Service, please do not use our application.
ar: من خلال الوصول إلى تطبيق TO-DO واستخدامه، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية. إذا كنت لا توافق على شروط الخدمة هذه، يرجى عدم استخدام تطبيقنا.

# tosUseLicense
source: Use License
ar: ترخيص الاستخدام

# tosUseLicenseText
source: Permission is granted to temporarily use TO-DO App for personal, non-commercial use only. This is the grant of a license, not a transfer of title, and under this license you may not: • Modify or copy the application materials • Use the materials for any commercial purpose • Attempt to decompile or reverse engineer the software • Remove any copyright or proprietary notations • Transfer the materials to another person
ar: يُمنح الإذن باستخدام تطبيق TO-DO مؤقتاً للاستخدام الشخصي غير التجاري فقط. هذا منح ترخيص، وليس نقل ملكية، وبموجب هذا الترخيص لا يجوز لك: • تعديل أو نسخ مواد التطبيق • استخدام المواد لأي غرض تجاري • محاولة فك تجميع أو هندسة عكسية للبرنامج • إزالة أي حقوق نشر أو إشعارات ملكية • نقل المواد إلى شخص آخر

# tosUserAccounts
source: User Accounts
ar: حسابات المستخدمين

# tosUserAccountsText
source: When you create an account with us, you must provide accurate, complete, and current information. Failure to do so constitutes a breach of the Terms. You are responsible for: • Safeguarding your password • Any activities or actions under your account • Notifying us immediately of any unauthorized use
ar: عند إنشاء حساب معنا، يجب عليك تقديم معلومات دقيقة وكاملة وحديثة. عدم القيام بذلك يشكل خرقاً للشروط. أنت مسؤول عن: • حماية كلمة المرور الخاصة بك • أي أنشطة أو إجراءات تحت حسابك • إخطارنا على الفور بأي استخدام غير مصرح به

# tosAcceptableUse
source: Acceptable Use
ar: الاستخدام المقبول

# tosAcceptableUseText
source: You agree not to use the app to: • Violate any laws or regulations • Infringe on intellectual property rights • Transmit harmful code or viruses • Harass, abuse, or harm others • Engage in unauthorized access • Interfere with the app's functionality
ar: أنت توافق على عدم استخدام التطبيق من أجل: • انتهاك أي قوانين أو لوائح • انتهاك حقوق الملكية الفكرية • نقل أكواد أو فيروسات ضارة • مضايقة أو إساءة أو إيذاء الآخرين • الانخراط في وصول غير مصرح به • التدخل في وظائف التطبيق

# tosContentOwnership
source: Content Ownership
ar: ملكية المحتوى

# tosContentOwnershipText
source: You retain all rights to the tasks and content you create in the app. By using our service, you grant us a limited license to store and process your content solely for the purpose of providing the service. We reserve the right to remove content that violates these terms.
ar: تحتفظ بجميع الحقوق في المهام والمحتوى الذي تنشئه في التطبيق. باستخدام خدمتنا، فإنك تمنحنا ترخيصاً محدوداً لتخزين ومعالجة المحتوى الخاص بك فقط لغرض تقديم الخدمة. نحن نحتفظ بالحق في إزالة المحتوى الذي ينتهك هذه الشروط.

# tosServiceAvailability
source: Service Availability
ar: توفر الخدمة

# tosServiceAvailabilityText
source: We strive to provide uninterrupted service, but we do not guarantee that: • The app will be available at all times • The app will be error-free • Defects will be corrected immediately • The app is free of viruses or harmful components
ar: نسعى جاهدين لتوفير خدمة دون انقطاع، لكننا لا نضمن أن: • التطبيق سيكون متاحاً في جميع الأوقات • التطبيق سيكون خالياً من الأخطاء • سيتم تصحيح العيوب على الفور • التطبيق خالٍ من الفيروسات أو المكونات الضارة

# tosDisclaimer
source: Disclaimer of Warranties
ar: إخلاء المسؤولية عن الضمانات

# tosDisclaimerText
source: The app is provided "AS IS" and "AS AVAILABLE" without any warranties of any kind, either express or implied. We do not warrant that the app will meet your requirements or that it will be uninterrupted, timely, secure, or error-free.
ar: يتم توفير التطبيق "كما هو" و"كما هو متاح" دون أي ضمانات من أي نوع، صريحة أو ضمنية. نحن لا نضمن أن التطبيق سيلبي متطلباتك أو أنه سيكون دون انقطاع أو في الوقت المناسب أو آمناً أو خالياً من الأخطاء.

# tosLimitation
source: Limitation of Liability
ar: حدود المسؤولية

# tosLimitationText
source: To the maximum extent permitted by law, we shall not be liable for any indirect, incidental, special, consequential, or punitive damages, or any loss of profits or revenues, whether incurred directly or indirectly, or any loss of data, use, goodwill, or other intangible losses.
ar: إلى أقصى حد يسمح به القانون، لن نكون مسؤولين عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو عقابية، أو أي خسارة في الأرباح أو الإيرادات، سواء تم تكبدها بشكل مباشر أو غير مباشر، أو أي فقدان للبيانات أو الاستخدام أو النوايا الحسنة أو الخسائر غير الملموسة الأخرى.

# tosDataBackup
source: Data Backup
ar: النسخ الاحتياطي للبيانات

# tosDataBackupText
source: While we take regular backups of your data, you are responsible for maintaining your own backup copies of important information. We recommend exporting your tasks regularly.
ar: بينما نقوم بعمل نسخ احتياطية منتظمة لبياناتك، فأنت مسؤول عن الاحتفاظ بنسخك الاحتياطية الخاصة من المعلومات المهمة. نوصي بتصدير مهامك بانتظام.

# tosTermination
source: Termination
ar: الإنهاء

# tosTerminationText
source: We may terminate or suspend your account and access to the app immediately, without prior notice or liability, for any reason, including if you breach these Terms. Upon termination, your right to use the app will immediately cease. You may delete your account at any time from the app settings.
ar: قد ننهي أو نعلق حسابك والوصول إلى التطبيق على الفور، دون إشعار مسبق أو مسؤولية، لأي سبب من الأسباب، بما في ذلك إذا انتهكت هذه الشروط. عند الإنهاء، سينتهي حقك في استخدام التطبيق على الفور. يمكنك حذف حسابك في أي وقت من إعدادات التطبيق.

# tosChangesToTerms
source: Changes to Terms
ar: التغييرات على الشروط

# tosChangesToTermsText
source: We reserve the right to modify or replace these Terms at any time. If a revision is material, we will provide at least 30 days' notice prior to any new terms taking effect. By continuing to use the app after revisions become effective, you agree to be bound by the revised terms.
ar: نحتفظ بالحق في تعديل أو استبدال هذه الشروط في أي وقت. إذا كانت المراجعة جوهرية، فسنقدم إشعاراً لمدة 30 يوماً على الأقل قبل دخول أي شروط جديدة حيز التنفيذ. من خلال الاستمرار في استخدام التطبيق بعد أن تصبح المراجعات سارية، فإنك توافق على الالتزام بالشروط المنقحة.

# tosGoverningLaw
source: Governing Law
ar: القانون الحاكم

# tosGoverningLawText
source: These Terms shall be governed by and construed in accordance with the laws of the jurisdiction in which we operate, without regard to its conflict of law provisions.
ar: تخضع هذه الشروط وتفسر وفقاً لقوانين الولاية القضائية التي نعمل فيها، دون اعتبار لأحكام تنازع القوانين.

# tosContactInfo
source: Contact Information
ar: معلومات الاتصال

# tosContactInfoText
source: If you have any questions about these Terms of Service, please contact us at: Email: legal@todoapp.com Website: www.todoapp.com Support: support@todoapp.com
ar: إذا كانت لديك أي أسئلة حول شروط الخدمة هذه، يرجى الاتصال بنا على: البريد الإلكتروني: legal@todoapp.com الموقع الإلكتروني: www.todoapp.com الدعم: support@todoapp.com

# changeAccountNameTitle
source: Change Account Name
ar: تغيير اسم الحساب

source: Update Your Display Name
ar: تحديث اسم العرض الخاص بك

# displayNameDescription
source: This name will be displayed on your profile and throughout the app.
ar: سيظهر هذا الاسم في ملفك الشخصي وفي جميع أنحاء التطبيق.

source: Display Name
ar: اسم العرض

source: Enter your name
ar: أدخل اسمك

source: Update Name
ar: تحديث الاسم

# displayNameInfo
source: Your display name can be changed at any time and is visible to you throughout the app.
ar: يمكنك تغيير اسم العرض في أي وقت وهو مرئي لك في جميع أنحاء التطبيق.
