Repository: MohamedEmad7299/To-Do
Catalog: lib/l10n/app_*.arb
Languages: ar

# accountNameUpdated
source: Account name updated successfully
ar: تم تحديث اسم الحساب بنجاح

source: Failed to update name
ar: فشل تحديث الاسم

# pleaseEnterName
source: Please enter a name
ar: الرجاء إدخال اسم

# nameMinLength
source: Name must be at least 2 characters
ar: يجب أن يتكون الاسم من حرفين على الأقل

# nameMaxLength
source: Name must be less than 50 characters
ar: يجب أن يكون الاسم أقل من 50 حرفاً

# changePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

source: Update Your Password
ar: تحديث كلمة المرور

# updatePasswordDescription
source: Enter your current password and choose a new secure password.
ar: أدخل كلمة المرور الحالية واختر كلمة مرور جديدة آمنة.

source: Current Password
ar: كلمة المرور الحالية

# enterCurrentPassword
source: Enter your current password
ar: أدخل كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

# enterNewPassword
source: Enter your new password
ar: أدخل كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# reenterNewPassword
source: Re-enter your new password
ar: أعد إدخال كلمة المرور الجديدة

source: Password Requirements
ar: متطلبات كلمة المرور

# atLeast6Characters
source: At least 6 characters long
ar: 6 أحرف على الأقل

# differentFromCurrent
source: Different from current password
ar: مختلفة عن كلمة المرور الحالية

# useStrongPassword
source: Use a strong, unique password
ar: استخدم كلمة مرور قوية وفريدة

# passwordChangedSuccess
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# pleaseEnterCurrentPassword
source: Please enter your current password
ar: الرجاء إدخال كلمة المرور الحالية

# pleaseEnterNewPassword
source: Please enter a new password
ar: الرجاء إدخال كلمة مرور جديدة

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

# newPasswordMustBeDifferent
source: New password must be different from current password
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن الحالية

# pleaseConfirmNewPassword
source: Please confirm your new password
ar: الرجاء تأكيد كلمة المرور الجديدة

# currentPasswordIncorrect
source: Current password is incorrect
ar: كلمة المرور الحالية غير صحيحة

# newPasswordTooWeak
source: New password is too weak. Please use a stronger password
ar: كلمة المرور الجديدة ضعيفة جداً. الرجاء استخدام كلمة مرور أقوى

# requiresRecentLogin
source: Please log out and log in again before changing your password
ar: الرجاء تسجيل الخروج وتسجيل الدخول مرة أخرى قبل تغيير كلمة المرور

# passwordChangeFailed
source: Failed to change password
ar: فشل تغيير كلمة المرور

# socialProviderPasswordChange
source: Password change is only available for email/password accounts. You signed in with a social provider.
ar: تغيير كلمة المرور متاح فقط لحسابات البريد الإلكتروني/كلمة المرور. لقد سجلت الدخول بمزود اجتماعي.

source: Change Profile Image
ar: تغيير صورة الملف الشخصي

source: Update Your Profile Picture
ar: تحديث صورة ملفك الشخصي

# choosePhotoDescription
source: Choose a photo from your gallery or take a new one.
ar: اختر صورة من معرضك أو التقط صورة جديدة.

source: Select Photo
ar: اختيار صورة

source: Upload Image
ar: رفع الصورة

source: Photo Requirements
ar: متطلبات الصورة

# imageResized
source: Image will be resized to 512x512
ar: سيتم تغيير حجم الصورة إلى 512x512

# supportedFormats
source: Supported formats: JPG, PNG
ar: الصيغ المدعومة: JPG، PNG

# chooseClearPhoto
source: Choose a clear photo of yourself
ar: اختر صورة واضحة لنفسك

source: Choose from Gallery
ar: اختيار من المعرض

# takePhoto
source: Take a Photo
ar: التقاط صورة

source: Remove Current Photo
ar: إزالة الصورة الحالية

source: Remove Profile Image
ar: إزالة صورة الملف الشخصي

# removeImageConfirmation
source: Are you sure you want to remove your profile image?
ar: هل أنت متأكد من إزالة صورة ملفك الشخصي؟

source: Remove
ar: إزالة

# profileImageUpdated
source: Profile image updated successfully
ar: تم تحديث صورة الملف الشخصي بنجاح

# profileImageRemoved
source: Profile image removed successfully
ar: تمت إزالة صورة الملف الشخصي بنجاح

# pleaseSelectImage
source: Please select an image first
ar: الرجاء اختيار صورة أولاً

source: Failed to pick image
ar: فشل اختيار الصورة

source: Failed to take photo
ar: فشل التقاط الصورة

source: Failed to update image
ar: فشل تحديث الصورة

source: Failed to remove image
ar: فشل إزالة الصورة

# aboutUsTitle
source: About Us
ar: من نحن

source: Flutter Developer
ar: مطور Flutter

# appDescription
source: A modern task management app built with Flutter to help you organize your daily tasks efficiently.
ar: تطبيق حديث لإدارة المهام مبني بـ Flutter لمساعدتك في تنظيم مهامك اليومية بكفاءة.

source: Version
ar: الإصدار

source: Contact Information
ar: معلومات الاتصال

source: Phone
ar: الهاتف

source: Connect With Me
ar: تواصل معي

source: Made with Flutter
ar: صنع بـ Flutter

source: All rights reserved.
ar: جميع الحقوق محفوظة.

source: copied to clipboard
ar: تم النسخ إلى الحافظة

source: Frequently Asked Questions
ar: الأسئلة الشائعة

# howCanWeHelp
source: How can we help you?
ar: كيف يمكننا مساعدتك؟

# findAnswers
source: Find answers to common questions about UpTodo
ar: ابحث عن إجابات للأسئلة الشائعة حول UpTodo

source: Still need help?
ar: هل تحتاج المزيد من المساعدة؟

# contactSupportAt
source: Contact our support team at
ar: تواصل مع فريق الدعم على

# faqQuestion1
source: How do I create a new task?
ar: كيف أنشئ مهمة جديدة؟

# faqAnswer1
source: Tap the "+" button at the bottom of your screen to create a new task. Fill in the task name, description, select a category, set priority, and choose a date and time. Then tap "Create Task" to save it.
ar: اضغط على زر "+" في أسفل الشاشة لإنشاء مهمة جديدة. املأ اسم المهمة والوصف، اختر فئة، حدد الأولوية، واختر التاريخ والوقت. ثم اضغط على "إنشاء مهمة" لحفظها.

# faqQuestion2
source: What do the priority levels mean?
ar: ماذا تعني مستويات الأولوية؟

# faqAnswer2
source: Tasks have three priority levels: • High Priority (Flag 1): Urgent and important tasks that need immediate attention • Medium Priority (Flag 2): Important but not urgent tasks • Low Priority (Flag 3): Tasks that can be done when time permits Priority helps you organize and focus on what matters most.
ar: المهام لها ثلاثة مستويات أولوية: • أولوية عالية (علم 1): مهام عاجلة ومهمة تحتاج اهتماماً فورياً • أولوية متوسطة (علم 2): مهام مهمة ولكن ليست عاجلة • أولوية منخفضة (علم 3): مهام يمكن إنجازها عند توفر الوقت تساعدك الأولوية في التنظيم والتركيز على الأهم.

# faqQuestion3
source: How can I mark a task as complete?
ar: كيف أحدد مهمة كمكتملة؟

# faqAnswer3
source: Simply tap the checkbox next to any task to mark it as complete. The task will be moved to your completed tasks list. You can always view completed tasks by filtering your task view.
ar: ببساطة اضغط على مربع الاختيار بجانب أي مهمة لتحديدها كمكتملة. ستنتقل المهمة إلى قائمة المهام المكتملة. يمكنك دائماً عرض المهام المكتملة من خلال تصفية عرض المهام.

# faqQuestion4
source: What happens to completed tasks?
ar: ماذا يحدث للمهام المكتملة؟

# faqAnswer4
source: Completed tasks are automatically deleted after 24 hours to keep your task list clean and organized. This helps improve app performance and keeps you focused on current tasks. Don't worry - you can still access completed tasks within the 24-hour window by filtering your task view.
ar: يتم حذف المهام المكتملة تلقائياً بعد 24 ساعة للحفاظ على قائمة مهامك نظيفة ومنظمة. هذا يساعد في تحسين أداء التطبيق ويبقيك مركزاً على المهام الحالية. لا تقلق - يمكنك الوصول للمهام المكتملة خلال فترة الـ 24 ساعة من خلال تصفية عرض المهام.

# faqQuestion5
source: How do I enable fingerprint login?
ar: كيف أفعّل تسجيل الدخول ببصمة الإصبع؟

# faqAnswer5
source: Go to Settings > Security and toggle on "Fingerprint Login". You'll need to authenticate with your fingerprint and, if you signed in with email/password, enter your password to securely store your credentials. Fingerprint login provides quick and secure access to your account.
ar: اذهب إلى الإعدادات > الأمان وفعّل "تسجيل الدخول ببصمة الإصبع". ستحتاج للمصادقة ببصمتك، وإذا سجلت الدخول بالبريد/كلمة المرور، أدخل كلمة مرورك لتخزين بياناتك بأمان. تسجيل الدخول ببصمة الإصبع يوفر وصولاً سريعاً وآمناً لحسابك.

# faqQuestion6
source: Can I edit or delete a task?
ar: هل يمكنني تعديل أو حذف مهمة؟

# faqAnswer6
source: Yes! Tap on any task to view its details. From there, you can: • Edit task information by tapping the edit button • Delete the task by tapping the delete button • Mark it as complete/incomplete You can also swipe left on a task in the list for quick actions.
ar: نعم! اضغط على أي مهمة لعرض تفاصيلها. من هناك يمكنك: • تعديل معلومات المهمة بالضغط على زر التعديل • حذف المهمة بالضغط على زر الحذف • تحديدها كمكتملة/غير مكتملة يمكنك أيضاً السحب لليسار على مهمة في القائمة للإجراءات السريعة.

# faqQuestion7
source: How do task categories work?
ar: كيف تعمل فئات المهام؟

# faqAnswer7
source: Categories help you organize tasks by type or context. Choose from predefined categories like Work, Personal, Shopping, Health, or Other when creating a task. You can filter your task list by category to focus on specific areas of your life.
ar: تساعدك الفئات في تنظيم المهام حسب النوع أو السياق. اختر من الفئات المحددة مسبقاً مثل العمل، الشخصية، التسوق، الصحة، أو أخرى عند إنشاء مهمة. يمكنك تصفية قائمة مهامك حسب الفئة للتركيز على مجالات محددة من حياتك.

# faqQuestion8
source: Is my data safe and private?
ar: هل بياناتي آمنة وخاصة؟

# faqAnswer8
source: Absolutely! All your tasks are securely stored in Firebase and are only accessible to you. Your credentials are encrypted, and biometric data (fingerprint) never leaves your device. We take your privacy seriously and never share your data with third parties.
ar: بالتأكيد! جميع مهامك مخزنة بأمان في Firebase ولا يمكن الوصول إليها إلا أنت. بيانات اعتمادك مشفرة، والبيانات البيومترية (بصمة الإصبع) لا تغادر جهازك أبداً. نحن نأخذ خصوصيتك على محمل الجد ولا نشارك بياناتك مع أطراف ثالثة.

# faqQuestion9
source: Can I use the app offline?
ar: هل يمكنني استخدام التطبيق بدون إنترنت؟

# faqAnswer9
source: The app requires an internet connection to sync your tasks across devices and save changes to the cloud. However, you can view previously loaded tasks offline. Changes made offline will be synced automatically when you reconnect to the internet.
ar: يتطلب التطبيق اتصالاً بالإنترنت لمزامنة مهامك عبر الأجهزة وحفظ التغييرات في السحابة. ومع ذلك، يمكنك عرض المهام المحملة مسبقاً بدون اتصال. سيتم مزامنة التغييرات المجراة بدون اتصال تلقائياً عند إعادة الاتصال بالإنترنت.

# faqQuestion10
source: How do I sign out of my account?
ar: كيف أسجل الخروج من حسابي؟

# faqAnswer10
source: To sign out, go to your Profile screen and tap the "Logout" button. You'll be asked to confirm before signing out. Make sure all your tasks are synced before signing out to avoid losing any data.
ar: لتسجيل الخروج، اذهب إلى شاشة الملف الشخصي واضغط على زر "تسجيل الخروج". سيُطلب منك التأكيد قبل تسجيل الخروج. تأكد من مزامنة جميع مهامك قبل تسجيل الخروج لتجنب فقدان أي بيانات.

# faqQuestion11
source: What should I do if I forgot my password?
ar: ماذا أفعل إذا نسيت كلمة المرور؟

# faqAnswer11
source: On the login screen, tap "Forgot Password?" and enter your email address. We'll send you a password reset link to your email. Follow the instructions in the email to create a new password and regain access to your account.
ar: في شاشة تسجيل الدخول، اضغط على "نسيت كلمة المرور؟" وأدخل بريدك الإلكتروني. سنرسل لك رابط إعادة تعيين كلمة المرور. اتبع التعليمات في البريد لإنشاء كلمة مرور جديدة واستعادة الوصول لحسابك.

# faqQuestion12
source: Can I sync tasks across multiple devices?
ar: هل يمكنني مزامنة المهام عبر أجهزة متعددة؟

# faqAnswer12
source: Yes! Your tasks are automatically synced across all devices where you're signed in with the same account. Simply log in with your email or social account on any device. Changes are synced in real-time, so you'll always have access to your latest tasks.
ar: نعم! يتم مزامنة مهامك تلقائياً عبر جميع الأجهزة التي سجلت الدخول فيها بنفس الحساب. ببساطة سجل الدخول ببريدك أو حسابك الاجتماعي على أي جهاز. يتم المزامنة في الوقت الفعلي، لذا ستتمكن دائماً من الوصول لأحدث مهامك.

# helpAndFeedback
source: Help & Feedback
ar: المساعدة والملاحظات

source: We're here to help!
ar: نحن هنا للمساعدة!

# browseHelpTopics
source: Browse help topics or send us your feedback
ar: تصفح مواضيع المساعدة أو أرسل لنا ملاحظاتك

source: Send Feedback
ar: إرسال ملاحظات

source: Send us your feedback
ar: أرسل لنا ملاحظاتك

# weLoveToHear
source: We'd love to hear from you!
ar: يسعدنا أن نسمع منك!

source: Contact Support
ar: الاتصال بالدعم

source: Feedback Type
ar: نوع الملاحظات

source: Your Feedback
ar: ملاحظاتك

source: Tell us what you think...
ar: أخبرنا برأيك...

# generalFeedback
source: General
ar: عام

source: Bug Report
ar: تقرير خطأ

source: Feature Request
ar: طلب ميزة

source: Suggestion
ar: اقتراح

source: Send
ar: إرسال

# thankYouForFeedback
source: Thank you for your feedback!
ar: شكراً لملاحظاتك!

# helpGettingStarted
source: Getting Started
ar: البدء

# helpGettingStartedDesc
source: Welcome to UpTodo! Start by creating your first task using the "+" button. Organize your tasks by categories, set priorities, and never miss a deadline with our reminder system. Explore the app to discover all features and make the most of your productivity journey.
ar: مرحباً بك في UpTodo! ابدأ بإنشاء مهمتك الأولى باستخدام زر "+". نظم مهامك حسب الفئات، حدد الأولويات، ولا تفوت أي موعد نهائي مع نظام التذكير. استكشف التطبيق لاكتشاف جميع الميزات والاستفادة القصوى من رحلة إنتاجيتك.

# helpManagingTasks
source: Managing Your Tasks
ar: إدارة مهامك

# helpManagingTasksDesc
source: Keep your tasks organized: • Create tasks with detailed descriptions • Assign categories for better organization • Set priority levels (High, Medium, Low) • Add due dates and times • Mark tasks as complete when done Swipe left on tasks for quick actions like edit and delete.
ar: حافظ على تنظيم مهامك: • أنشئ مهام بأوصاف تفصيلية • عيّن فئات لتنظيم أفضل • حدد مستويات الأولوية (عالية، متوسطة، منخفضة) • أضف تواريخ وأوقات الاستحقاق • حدد المهام كمكتملة عند الانتهاء اسحب لليسار على المهام للإجراءات السريعة مثل التعديل والحذف.

# helpAccountProfile
source: Account & Profile
ar: الحساب والملف الشخصي

# helpAccountProfileDesc
source: Personalize your experience: • Update your profile picture • Change your display name • Update your password for security • Enable biometric login for quick access • Sync across multiple devices Your data is securely stored and accessible only to you.
ar: خصص تجربتك: • حدّث صورة ملفك الشخصي • غيّر اسم العرض • حدّث كلمة المرور للأمان • فعّل تسجيل الدخول البيومتري للوصول السريع • زامن عبر أجهزة متعددة بياناتك مخزنة بأمان ولا يمكن الوصول إليها إلا أنت.

# helpSecurityPrivacy
source: Security & Privacy
ar: الأمان والخصوصية

# helpSecurityPrivacyDesc
source: We take your security seriously: • All data is encrypted and stored securely in Firebase • Biometric authentication available for quick secure access • Your credentials are never shared with third parties • Fingerprint data never leaves your device You have full control over your data at all times.
ar: نأخذ أمانك على محمل الجد: • جميع البيانات مشفرة ومخزنة بأمان في Firebase • المصادقة البيومترية متاحة للوصول الآمن السريع • بيانات اعتمادك لا تُشارك مع أطراف ثالثة • بيانات بصمة الإصبع لا تغادر جهازك لديك تحكم كامل في بياناتك في جميع الأوقات.

# helpTroubleshooting
source: Troubleshooting
ar: استكشاف الأخطاء

# helpTroubleshootingDesc
source: Having issues? Try these steps: • Make sure you have a stable internet connection • Check if the app is updated to the latest version • Try signing out and signing back in • Clear the app cache if experiencing performance issues • Restart your device If problems persist, contact our support team.
ar: تواجه مشاكل؟ جرب هذه الخطوات: • تأكد من اتصال إنترنت مستقر • تحقق من تحديث التطبيق لأحدث إصدار • جرب تسجيل الخروج وتسجيل الدخول مرة أخرى • امسح ذاكرة التخزين المؤقت إذا واجهت مشاكل في الأداء • أعد تشغيل جهازك إذا استمرت المشاكل، تواصل مع فريق الدعم.

# helpTipsBestPractices
source: Tips & Best Practices
ar: نصائح وأفضل الممارسات

# helpTipsBestPracticesDesc
source: Get the most out of UpTodo: • Review your tasks at the start of each day • Use priority levels to focus on what matters • Break large tasks into smaller, manageable ones • Set realistic deadlines to avoid stress • Regularly archive or delete completed tasks • Use categories to organize different areas of your life
ar: احصل على أقصى استفادة من UpTodo: • راجع مهامك في بداية كل يوم • استخدم مستويات الأولوية للتركيز على الأهم • قسّم المهام الكبيرة إلى أجزاء أصغر قابلة للإدارة • حدد مواعيد نهائية واقعية لتجنب الضغط • احذف أو أرشف المهام المكتملة بانتظام • استخدم الفئات لتنظيم مجالات حياتك المختلفة

# supportUsTitle
source: Support Us
ar: ادعمنا

source: Support Our Work
ar: ادعم عملنا

# supportDescription
source: Your support helps us keep the app free and continuously improve it with new features
ar: دعمك يساعدنا في الحفاظ على التطبيق مجانياً وتحسينه باستمرار بميزات جديدة

source: Payment Methods
ar: طرق الدفع

source: Why Support?
ar: لماذا الدعم؟

source: New Features
ar: ميزات جديدة

# helpDevelopFeatures
source: Help us develop exciting new features
ar: ساعدنا في تطوير ميزات جديدة مثيرة

source: Bug Fixes
ar: إصلاح الأخطاء

# supportMaintenance
source: Support ongoing maintenance and improvements
ar: ادعم الصيانة والتحسينات المستمرة

source: Free Forever
ar: مجاني للأبد

# keepAppFree
source: Keep the app free for everyone
ar: حافظ على التطبيق مجانياً للجميع

source: Developer Support
ar: دعم المطور

# buyUsCoffee
source: Buy us a coffee to keep us motivated
ar: اشترِ لنا قهوة لتحفيزنا

# thankYouMessage
source: Every contribution, no matter how small, makes a huge difference. Thank you for your support!
ar: كل مساهمة، مهما كانت صغيرة، تحدث فرقاً كبيراً. شكراً لدعمك!

# detailsCopied
source: details copied to clipboard!
ar: تم نسخ التفاصيل إلى الحافظة!

# logoutConfirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Change Theme Color
ar: تغيير لون السمة

source: Select Color
ar: اختر لوناً

source: Task Details
ar: تفاصيل المهمة

source: Task Name
ar: اسم المهمة

source: Enter task name
ar: أدخل اسم المهمة

source: Enter task description
ar: أدخل وصف المهمة

# taskNameEmpty
source: Task name cannot be empty
ar: اسم المهمة لا يمكن أن يكون فارغاً

source: Task updated successfully
ar: تم تحديث المهمة بنجاح

source: Delete Task
ar: حذف المهمة

# deleteTaskConfirm
source: Are you sure you want to delete this task?
ar: هل أنت متأكد أنك تريد حذف هذه المهمة؟

source: Task deleted
ar: تم حذف المهمة

source: Category
ar: الفئة

source: Due Date
ar: تاريخ الاستحقاق

source: Due Time
ar: وقت الاستحقاق

source: Mark as Complete
ar: وضع علامة مكتمل

source: In Progress
ar: قيد التنفيذ

source: Created
ar: تم الإنشاء

source: Edit Task
ar: تعديل المهمة

source: No completed tasks
ar: لا توجد مهام مكتملة

# noTasksForDate
source: No tasks for this date
ar: لا توجد مهام لهذا التاريخ

source: Today
ar: اليوم

source: Focus Mode
ar: وضع التركيز

# focusModeDescription
source: While your focus mode is on, all of your notifications will be off
ar: أثناء تشغيل وضع التركيز، سيتم إيقاف جميع إشعاراتك

source: Start Focusing
ar: بدء التركيز

source: Stop Focusing
ar: إيقاف التركيز

source: Overview
ar: نظرة عامة

source: This Week
ar: هذا الأسبوع

source: Applications
ar: التطبيقات

source: You spent
ar: قضيت

# minutesToday
source: min on it today
ar: دقيقة اليوم

# appsThatMayDistract
source: Apps that may consume your time
ar: تطبيقات قد تستهلك وقتك

source: Common distraction
ar: مصدر إلهاء شائع

source: Choose Theme Color
ar: اختر لون السمة

source: Apply
ar: تطبيق
